Revit 2026 API

# ImageTypePageNumber Property

---

The number of the page in a multi-page file, that was used to create the image in the ImageType.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int PageNumber { get; }
```
```vb
Public ReadOnly Property PageNumber As Integer
	Get
```
```cpp
public:
property int PageNumber {
	int get ();
}
```
```fsharp
member PageNumber : int with get
```

#### Property Value

Int32

This number is set when the ImageType is created or reloaded.

#### Reference

ImageType Class

Autodesk.Revit.DB Namespace